{
	"translations": {
		"en": {
			"header": {
				"home": "Home",
				"portfolio": "Portfolio",
				"contact": "Contact"
			},
			"profile": "Hey, I'm Yurii",
			"profile_info": "I'm a self-taught web developer. My passion for web development allows me to create dynamic and modern websites that not only impress with their design, but also guarantee a flawless user experience.",
			"hobby": "What I Do",
			"hobby_info": "I'm passionate about everything in technology; from designing and developing software, to understanding how the many moving parts of the internet work together, to cybersecurity, programming, and so much more. I strive to learn more about these things every day, and utilize my knowledge to further understand how or why the technology around us works.",
			"technologies": "Technologies",
			"technologies_info": "I use a variety of tools to streamline my development process and increase the quality of both my code, and my projects. Below is a list of technologies and languages I've had experience with in the past, or use currently.",
			"projects": "Projects",
			"projects_info": "In my free time, I enjoy creating open source projects on GitHub, so I can learn from others and share what I know.",
			"chat": "Leave a request",
			"chat_info": "Have an inquiry, or want to connect? Feel free to leave a message below, or get in touch via Discord, Twitter, or email.",
			"time": [
				"It's currently",
				"for me, so I'm probably",
				"awake",
				"sleeping",
				". I'll get back to you soon."
			],
			"portfolio": {
				"title": "Portfolio",
				"subtitle": "Projects made by me or in which I participated."
			},
			"contact_me": {
				"thanks": "Thanks for reaching out! I'll get back to you soon.",
				"email": "EMAIL",
				"message": "MESSAGE",
				"message_placehorder": "Hi Yurii, what's up?",
				"send": "Send"
			}
		},
		"ua": {
			"header": {
				"home": "Головна",
				"portfolio": "Портфоліо",
				"contact": "Контакти"
			},
			"profile": "Привіт, я Юрій",
			"profile_info": "Я веб-розробник. Моя пристрасть до веб-розробки дозволяє мені створювати динамічні та сучасні веб-сайти, які не тільки вражають своїм дизайном, але й гарантують бездоганний користувацький досвід.",
			"hobby": "Мої захоплення",
			"hobby_info": "Я захоплююся всім, що стосується технологій: від проектування та розробки програмного забезпечення до розуміння того, як багато рухомих частин інтернету працюють разом, до кібербезпеки, програмування та багато чого іншого. Я прагну дізнаватися більше про ці речі щодня і використовувати свої знання, щоб краще зрозуміти, як і чому працюють технології навколо нас.",
			"technologies": "Технології",
			"technologies_info": "Я використовую різноманітні інструменти для оптимізації процесу розробки та підвищення якості як мого коду, так і моїх проектів. Нижче наведено список технологій та мов, з якими я мав досвід роботи в минулому або використовую зараз.",
			"projects": "Проекти",
			"projects_info": "У вільний час я люблю створювати проекти з відкритим вихідним кодом на GitHub, щоб вчитися у інших і ділитися своїми знаннями.",
			"chat": "Залишити заявку",
			"chat_info": "Маєте запитання або хочете зв'язатися? Не соромтеся залишати повідомлення нижче, або зв'яжіться зі мною через Discord, Twitter чи електронну пошту.",
			"time": [
				"Зараз",
				"за київським часом, тож я ймовірно,",
				"не сплю",
				"сплю",
				". Відповім, як тільки зможу."
			],
			"portfolio": {
				"title": "Портфоліо",
				"subtitle": "Проекти зроблені мною або в яких я брав участь."
			},
			"contact_me": {
				"thanks": "Дякую, що звернулися! Я скоро з вами зв'яжуся.",
				"email": "ПОШТА",
				"message": "ПОВІДОМЛЕНЯ",
				"message_placehorder": "Привіт Юрій, як справи?",
				"send": "Відправити"
			}
		}
	},
	"skills": [
		{ "text": "HTML5", "icon": "html5", "color": "#dd683b" },
		{ "text": "CSS3", "icon": "css3", "color": "#3f69e9" },
		{ "text": "JavaScript", "icon": "js", "color": "#ebd94d" },
		{ "text": "React", "icon": "react", "color": "#79c4da" },
		{ "text": "Figma", "icon": "figma", "color": "#63cf8d" },
		{ "text": "Responsive Design", "icon": "code", "color": "#ef7e6e" }
	],
	"socialLinks": [
		{ "href": "https://github.com/mescyura", "icon": "github" },
		{ "href": "https://linkedin.com/in/yura-holyda", "icon": "linkedin" },
		{ "href": "https://twitter.com/mescyuraa", "icon": "twitter" },
		{ "href": "https://t.me/mescyura", "icon": "telegram" }
	]
}
