{
	"translations": {
		"en": {
			"header": {
				"home": "Home",
				"portfolio": "Portfolio",
				"contact": "Contact"
			},
			"profile": "Hey, I'm Yurii",
			"profile_info": "I'm a self-taught web developer. My passion for web development allows me to create dynamic and modern websites that not only impress with their design, but also guarantee a flawless user experience.",
			"hobby": "What I Do",
			"hobby_info": "I'm passionate about everything in technology; from designing and developing software, to understanding how the many moving parts of the internet work together, to cybersecurity, programming, and so much more. I strive to learn more about these things every day, and utilize my knowledge to further understand how or why the technology around us works.",
			"technologies": "Technologies",
			"technologies_info": "I use a variety of tools to streamline my development process and increase the quality of both my code, and my projects. Below is a list of technologies and languages I've had experience with in the past, or use currently.",
			"projects": "Projects",
			"projects_info": "In my free time, I enjoy creating open source projects on GitHub, so I can learn from others and share what I know.",
			"chat": "Leave a request",
			"chat_info": "Have an inquiry, or want to connect? Feel free to leave a message below, or get in touch via Discord, Telegram, or email.",
			"time": [
				"It's currently",
				"for me, so I'm probably",
				"awake",
				"sleeping",
				". I'll get back to you soon."
			],
			"portfolio": {
				"title": "Portfolio",
				"subtitle": "Projects made by me or in which I participated.",
				"projects": {
					"deren": {
						"name": "creo.deren.com.ua",
						"href": "https://creo.deren.com.ua/",
						"tools": ["HTML", "CSS", "Sass", "JavaScript"],
						"description": "Developed a landing page promoting a new course creative content development. Worked with media queries and responsive design techniques to ensure a mobile-first approach, catering to users on both desktop and mobile. Contributed to a 70% growth in course enrollment within the first launch month."
					},
					"meyes": {
						"name": "meyes.app",
						"href": "https://meyes.app/",
						"tools": ["HTML", "CSS", "Sass", "JavaScript", "Python"],
						"description": "Developed a responsive landing page for a startup called Meyes using HTML, CSS, and JavaScript. Integrated video backgrounds, custom animations, and device detection to correctly display the appropriate store button to increase user engagement and improve visual appeal."
					},
					"doe": {
						"name": "doe.app",
						"href": null,
						"tools": ["TypeScript", "React", "Redux", "Less"],
						"description": "Participated in the development of React components for doe.app, creation of reusable and flexible UI elements, state management using Redux, performance optimisation and integration of the application with the backend via API."
					},
					"shop-bakery": {
						"name": "shop-bakery.com",
						"href": "https://mescyura.github.io/shop-bakery/",
						"tools": ["HTML", "CSS", "Sass", "JavaScript"],
						"description": "Developed a personal project as part of a course genius.space, creating a landing page using HTML, CSS, and JavaScript. Explored responsive web design, worked on animations, and implemented user interactions with JavaScript."
					}
				}
			},
			"contact_me": {
				"thanks": "Thanks for reaching out! I'll get back to you soon.",
				"email": "EMAIL",
				"message": "MESSAGE",
				"message_placehorder": "Hi Yurii, what's up?",
				"send": "Send"
			}
		},
		"ua": {
			"header": {
				"home": "Головна",
				"portfolio": "Портфоліо",
				"contact": "Контакти"
			},
			"profile": "Привіт, я Юрій",
			"profile_info": "Я веб-розробник. Моя пристрасть до веб-розробки дозволяє мені створювати динамічні та сучасні веб-сайти, які не тільки вражають своїм дизайном, але й гарантують бездоганний користувацький досвід.",
			"hobby": "Мої захоплення",
			"hobby_info": "Я захоплююся всім, що стосується технологій: від проектування та розробки програмного забезпечення до розуміння того, як багато рухомих частин інтернету працюють разом, до кібербезпеки, програмування та багато чого іншого. Я прагну дізнаватися більше про ці речі щодня і використовувати свої знання, щоб краще зрозуміти, як і чому працюють технології навколо нас.",
			"technologies": "Технології",
			"technologies_info": "Я використовую різноманітні інструменти для оптимізації процесу розробки та підвищення якості як мого коду, так і моїх проектів. Нижче наведено список технологій та мов, з якими я мав досвід роботи в минулому або використовую зараз.",
			"projects": "Проекти",
			"projects_info": "У вільний час я люблю створювати проекти з відкритим вихідним кодом на GitHub, щоб вчитися у інших і ділитися своїми знаннями.",
			"chat": "Залишити заявку",
			"chat_info": "Маєте запитання або хочете зв'язатися? Не соромтеся залишати повідомлення нижче, або зв'яжіться зі мною через Discord, Telegram чи електронну пошту.",
			"time": [
				"Зараз",
				"за київським часом, тож я ймовірно,",
				"не сплю",
				"сплю",
				". Відповім, як тільки зможу."
			],
			"portfolio": {
				"title": "Портфоліо",
				"subtitle": "Проекти зроблені мною або в яких я брав участь.",
				"projects": {
					"deren": {
						"name": "creo.deren.com.ua",
						"href": "https://creo.deren.com.ua/",
						"tools": ["HTML", "CSS", "Sass", "JavaScript"],
						"description": "Розробив лендінг для просування нового курсу з розробки креативного контенту. Працював з медіа-запитами та методами адаптивного дизайну, щоб забезпечити mobile-first підходу, орієнтованого на користувачів як настільних, так і мобільних пристроїв. Легдінг забезпечив кількість зареєстрованих на курс, на 70% більше, протягом першого місяця після запуску."
					},
					"meyes": {
						"name": "meyes.app",
						"href": "https://meyes.app/",
						"tools": ["HTML", "CSS", "Sass", "JavaScript", "Python"],
						"description": "Розробив адаптивну цільову сторінку для стартапу Meyes, використовуючи HTML, CSS та JavaScript. Інтегрував відео фон, кастомні анімації та визначення пристрою для правильного відображення відповідної кнопки магазину, щоб підвищити залученість користувачів та покращити візуальну привабливість."
					},
					"doe": {
						"name": "doe.app",
						"href": null,
						"tools": ["TypeScript", "React", "Redux", "Less"],
						"description": "Брав участь у розробці React-компонентів для doe.app, створюючи багаторазові та гнучкі UI-елементи, працюючи з керуванням станом Redux, оптимізуючи продуктивність та інтегруючи застосунок із бекендом через API."
					},
					"shop-bakery": {
						"name": "shop-bakery.com",
						"href": "https://mescyura.github.io/shop-bakery/",
						"tools": ["HTML", "CSS", "Sass", "JavaScript"],
						"description": "Розробив домашній проєкт у рамках навчального курсу genius.space, створивши лендінг-сторінку з використанням HTML, CSS та JavaScript. В процесі роботи розібрав структуру адаптивного веб-дизайну, опрацював анімації та взаємодію з користувачем через JS."
					}
				}
			},
			"contact_me": {
				"thanks": "Дякую, що звернулися! Я скоро з вами зв'яжуся.",
				"email": "ПОШТА",
				"message": "ПОВІДОМЛЕНЯ",
				"message_placehorder": "Привіт Юрій, як справи?",
				"send": "Відправити"
			}
		}
	}
}
